# 	{} — фігурні дужки вказують на місце для форматування значення.
# 	: — використовується для розділення значення і формату.
#   .nf — визначає кількість десяткових знаків.
#   :, — додає коми для розділу тисяч.
# 	:.2% — перетворює число на відсоток і форматує його з двома десятковими знаками.
# 	>, <, ^ — визначають вирівнювання в полі заданої ширини.

# Name = 'Name'
# Share = 'Share'
# Price = 'Price'
# Change = 'Change'

# print(f"{Name:<10} {Share:>10} {Price:^10} {Change:^10}")
# print('---------- '*4)
# print(f"{'AA':<10} {100:>10} {'$9.22':>10} {'-22.98%':>10}")
# print(f"{'IBM':<10} {50:>10} {'$106.28':>10} {'15.18%':>10}")
# print(f"{'CAT':<10} {150:>10} {'$36.46':>10} {'-47.98%':>10}")
# print(f"{'MSFT':<10} {200:>10} {'$20.89':>10} {'-30.34':>10}")
# print(f"{'GE':<10} {95:>10} {'$13.48':>10} {'-26.89%':>10}")
# print(f"{'MSFT':<10} {50:>10} {'$20.89':>10} {'-44.21%':>10}")
# print(f"{'IBM':<10} {100:>10} {'$106.28':>10} {'-36.84%':>10}")

# ------------------------------------------------------------------------
class book:
    book_name = input('Введіть назву книги: ')
    book_autor = input('Введіть автора (американського автора): ')
    book_year_of_publication = input('Введіть рік видання: ')
    book_count = input('Введіть кількість екземплярів: ')
    book_cost = input('Введіть вартість книги: ')
    book_rating = input('Введіть рейтинг книги: ')

   def ___init___ (self,)



book_info = f''' 
Інформація про книгу:
Назва: {book.book_name}
Автор: {book.book_autor}
Рік видання: {book.book_year_of_publication}
Кількість екземплярів: {book.book_count}
Вартість: {book.book_cost}
Рейтинг: {book.book_rating}
'''
print(book_info)