date = set("Hello")
date = {5,2,34,1,5,6,4}

date.add(47)                # добавить 
date.update([32121,12,51])  # добавить много
date.remove(47)             # удалить значение
date.pop()                  # удалить первое значение
date.clear                  # очистить

print(date)
# ---------------------------------------------------------------------------

nums = [5,2,4,5,6,1,2,3,5,6,5,4,1]
number = set(nums) # множество которое можно менять 

new_date = frozenset(nums) # множество которое нельзя менять 

print(nums)                 




