import numpy as np
import pandas as pd

dict_array = {'age': ['Сергей', 'Маша', 'Ксюша', 'Аристарх', 'Соня'], 
              'name': [53, 37, 11, 18, 7], 
              'наличие авто': [True, True, False, True, False]}

df = pd.DataFrame(dict_array, 
               index=['row_0', 'row_1', 'row_2', 'row_3', 'row_4']
               )

df.iat['индексы строк', 'индексы столбца']
df.iat[0, 1] =  'Yes'                          # возвращает или заменяет нужный элемент таблици 

df.at['метка строки', 'метка столбца']         # возвращает или заменяет нужный элемент таблици 
df.at['row_1', 'name'] = 'Yes'

df.iloc[ 'индекс строки', 'индекс столбца' ]   # возвращает или заменяет нужные элементы таблици 
df.iloc[ ['список индексов строк'], ['список индексов столбцов'] ] 
df.iloc[ 'срезы: индексов, срезы: индексов' ]
df.iloc[ ['cписок булевых эначений'], ['список булевых эначений'] ]

df['наличие авто'].to_list() # преобразовать серию в список

df.loc['метки строк', 'метки столбцов'] # приоритет для фильтрации
df.loc[['row_1', 'row_2']]              # возвращает строки
df.loc[:, ['age', 'name']]              # возвращает столбцы
df.loc['row_0': 'row_3', 'name'] 
df.loc['row _0': 'row_3', ['name']]

df.loc[ df['name'] == 99]               # возвращает строки, в которых значение 99
df.loc['row_0':'row_2', 'name'] = 1     # меняет значения в срезе
df.loc['row_e': 'row_2', 'age'] = pd.Series(['йегрес', 'ашам', 'ашюсK'], index=['row_0', 'row_1', 'row_2'])

df.loc['row_0': 'row_2', ['age', 'name']] = pd.DataFrame({'age': ['Сергей', 'Маша', 'Ксюша'], 
                                                                  'name': [22, 33, 44]}, 
                                                                  index=['row_0', 'row_1', 'row_2'])

df.loc[:, ['name', 'age']] = df[['age', 'name']].to_numpy() # менять меcтами столбцы

print(df.iat[0, 1])